{
    "@odata.type": "#microsoft.graph.windows10GeneralConfiguration",
    "id": "f164e4d2-cd49-47da-bf8c-4cbfbf0773d8",
    "lastModifiedDateTime": "2020-11-25T05:28:24.7522228Z",
    "roleScopeTagIds": [
        "Privileged-Identity"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2020-11-16T17:58:19.5635557Z",
    "description": "",
    "displayName": "PAW-Win10-Config-Device-Restrictions-UI",
    "version": 9,
    "taskManagerBlockEndTask": false,
    "energySaverOnBatteryThresholdPercentage": null,
    "energySaverPluggedInThresholdPercentage": null,
    "powerLidCloseActionOnBattery": "notConfigured",
    "powerLidCloseActionPluggedIn": "notConfigured",
    "powerButtonActionOnBattery": "notConfigured",
    "powerButtonActionPluggedIn": "notConfigured",
    "powerSleepButtonActionOnBattery": "notConfigured",
    "powerSleepButtonActionPluggedIn": "notConfigured",
    "powerHybridSleepOnBattery": "enabled",
    "powerHybridSleepPluggedIn": "enabled",
    "windows10AppsForceUpdateSchedule": null,
    "enableAutomaticRedeployment": false,
    "microsoftAccountSignInAssistantSettings": "notConfigured",
    "authenticationAllowSecondaryDevice": true,
    "authenticationWebSignIn": "notConfigured",
    "authenticationPreferredAzureADTenantDomainName": null,
    "cryptographyAllowFipsAlgorithmPolicy": false,
    "displayAppListWithGdiDPIScalingTurnedOn": [],
    "displayAppListWithGdiDPIScalingTurnedOff": [],
    "enterpriseCloudPrintDiscoveryEndPoint": null,
    "enterpriseCloudPrintOAuthAuthority": null,
    "enterpriseCloudPrintOAuthClientIdentifier": null,
    "enterpriseCloudPrintResourceIdentifier": null,
    "enterpriseCloudPrintDiscoveryMaxLimit": null,
    "enterpriseCloudPrintMopriaDiscoveryResourceIdentifier": null,
    "experienceDoNotSyncBrowserSettings": "blocked",
    "messagingBlockSync": false,
    "messagingBlockMMS": false,
    "messagingBlockRichCommunicationServices": false,
    "printerNames": [],
    "printerDefaultName": null,
    "printerBlockAddition": false,
    "searchBlockDiacritics": false,
    "searchDisableAutoLanguageDetection": false,
    "searchDisableIndexingEncryptedItems": false,
    "searchEnableRemoteQueries": false,
    "searchDisableUseLocation": false,
    "searchDisableLocation": false,
    "searchDisableIndexerBackoff": false,
    "searchDisableIndexingRemovableDrive": false,
    "searchEnableAutomaticIndexSizeManangement": false,
    "searchBlockWebResults": false,
    "findMyFiles": "notConfigured",
    "securityBlockAzureADJoinedDevicesAutoEncryption": false,
    "diagnosticsDataSubmissionMode": "enhanced",
    "oneDriveDisableFileSync": true,
    "systemTelemetryProxyServer": null,
    "edgeTelemetryForMicrosoft365Analytics": "notConfigured",
    "inkWorkspaceAccess": "disabled",
    "inkWorkspaceAccessState": "blocked",
    "inkWorkspaceBlockSuggestedApps": false,
    "smartScreenEnableAppInstallControl": false,
    "smartScreenAppInstallControl": "notConfigured",
    "personalizationDesktopImageUrl": "https://i.imgur.com/OAJ28zO.png",
    "personalizationLockScreenImageUrl": null,
    "bluetoothAllowedServices": [],
    "bluetoothBlockAdvertising": true,
    "bluetoothBlockPromptedProximalConnections": true,
    "bluetoothBlockDiscoverableMode": true,
    "bluetoothBlockPrePairing": true,
    "edgeBlockAutofill": false,
    "edgeBlocked": false,
    "edgeCookiePolicy": "userDefined",
    "edgeBlockDeveloperTools": false,
    "edgeBlockSendingDoNotTrackHeader": true,
    "edgeBlockExtensions": false,
    "edgeBlockInPrivateBrowsing": true,
    "edgeBlockJavaScript": false,
    "edgeBlockPasswordManager": false,
    "edgeBlockAddressBarDropdown": false,
    "edgeBlockCompatibilityList": false,
    "edgeClearBrowsingDataOnExit": true,
    "edgeAllowStartPagesModification": false,
    "edgeDisableFirstRunPage": false,
    "edgeBlockLiveTileDataCollection": true,
    "edgeSyncFavoritesWithInternetExplorer": false,
    "edgeFavoritesListLocation": null,
    "edgeBlockEditFavorites": false,
    "edgeNewTabPageURL": null,
    "edgeHomeButtonConfiguration": null,
    "edgeHomeButtonConfigurationEnabled": false,
    "edgeOpensWith": "notConfigured",
    "edgeBlockSideloadingExtensions": false,
    "edgeRequiredExtensionPackageFamilyNames": [],
    "edgeBlockPrinting": false,
    "edgeFavoritesBarVisibility": "notConfigured",
    "edgeBlockSavingHistory": true,
    "edgeBlockFullScreenMode": false,
    "edgeBlockWebContentOnNewTabPage": false,
    "edgeBlockTabPreloading": false,
    "edgeBlockPrelaunch": false,
    "edgeShowMessageWhenOpeningInternetExplorerSites": "notConfigured",
    "edgePreventCertificateErrorOverride": true,
    "edgeKioskModeRestriction": "notConfigured",
    "edgeKioskResetAfterIdleTimeInMinutes": null,
    "cellularBlockDataWhenRoaming": false,
    "cellularBlockVpn": false,
    "cellularBlockVpnWhenRoaming": false,
    "cellularData": "allowed",
    "defenderRequireRealTimeMonitoring": true,
    "defenderRequireBehaviorMonitoring": true,
    "defenderRequireNetworkInspectionSystem": true,
    "defenderScanDownloads": true,
    "defenderScheduleScanEnableLowCpuPriority": false,
    "defenderDisableCatchupQuickScan": false,
    "defenderDisableCatchupFullScan": false,
    "defenderScanScriptsLoadedInInternetExplorer": true,
    "defenderBlockEndUserAccess": false,
    "defenderSignatureUpdateIntervalInHours": 1,
    "defenderMonitorFileActivity": "userDefined",
    "defenderDaysBeforeDeletingQuarantinedMalware": null,
    "defenderScanMaxCpu": null,
    "defenderScanArchiveFiles": true,
    "defenderScanIncomingMail": true,
    "defenderScanRemovableDrivesDuringFullScan": true,
    "defenderScanMappedNetworkDrivesDuringFullScan": false,
    "defenderScanNetworkFiles": true,
    "defenderRequireCloudProtection": true,
    "defenderCloudBlockLevel": "high",
    "defenderCloudExtendedTimeout": 50,
    "defenderCloudExtendedTimeoutInSeconds": 50,
    "defenderPromptForSampleSubmission": "sendAllDataWithoutPrompting",
    "defenderScheduledQuickScanTime": "18:00:00.0000000",
    "defenderScanType": "full",
    "defenderSystemScanSchedule": "saturday",
    "defenderScheduledScanTime": "18:00:00.0000000",
    "defenderPotentiallyUnwantedAppAction": "block",
    "defenderPotentiallyUnwantedAppActionSetting": "userDefined",
    "defenderSubmitSamplesConsentType": "sendSafeSamplesAutomatically",
    "defenderBlockOnAccessProtection": false,
    "defenderFileExtensionsToExclude": [],
    "defenderFilesAndFoldersToExclude": [],
    "defenderProcessesToExclude": [],
    "lockScreenAllowTimeoutConfiguration": false,
    "lockScreenBlockActionCenterNotifications": false,
    "lockScreenBlockCortana": true,
    "lockScreenBlockToastNotifications": true,
    "lockScreenTimeoutInSeconds": null,
    "lockScreenActivateAppsWithVoice": "notConfigured",
    "passwordBlockSimple": true,
    "passwordExpirationDays": null,
    "passwordMinimumLength": 9,
    "passwordMinutesOfInactivityBeforeScreenTimeout": 30,
    "passwordMinimumCharacterSetCount": 2,
    "passwordPreviousPasswordBlockCount": null,
    "passwordRequired": true,
    "passwordRequireWhenResumeFromIdleState": true,
    "passwordRequiredType": "alphanumeric",
    "passwordSignInFailureCountBeforeFactoryReset": 9,
    "passwordMinimumAgeInDays": null,
    "privacyAdvertisingId": "notConfigured",
    "privacyAutoAcceptPairingAndConsentPrompts": false,
    "privacyDisableLaunchExperience": false,
    "privacyBlockInputPersonalization": false,
    "privacyBlockPublishUserActivities": true,
    "privacyBlockActivityFeed": true,
    "activateAppsWithVoice": "notConfigured",
    "startBlockUnpinningAppsFromTaskbar": false,
    "startMenuAppListVisibility": "userDefined",
    "startMenuHideChangeAccountSettings": false,
    "startMenuHideFrequentlyUsedApps": false,
    "startMenuHideHibernate": false,
    "startMenuHideLock": false,
    "startMenuHidePowerButton": false,
    "startMenuHideRecentJumpLists": false,
    "startMenuHideRecentlyAddedApps": false,
    "startMenuHideRestartOptions": false,
    "startMenuHideShutDown": false,
    "startMenuHideSignOut": false,
    "startMenuHideSleep": true,
    "startMenuHideSwitchAccount": true,
    "startMenuHideUserTile": false,
    "startMenuLayoutEdgeAssetsXml": null,
    "startMenuLayoutXml": "PExheW91dE1vZGlmaWNhdGlvblRlbXBsYXRlIHhtbG5zOmRlZmF1bHRsYXlvdXQ9Imh0dHA6Ly9zY2hlbWFzLm1pY3Jvc29mdC5jb20vU3RhcnQvMjAxNC9GdWxsRGVmYXVsdExheW91dCIgeG1sbnM6c3RhcnQ9Imh0dHA6Ly9zY2hlbWFzLm1pY3Jvc29mdC5jb20vU3RhcnQvMjAxNC9TdGFydExheW91dCIgVmVyc2lvbj0iMSIgeG1sbnM9Imh0dHA6Ly9zY2hlbWFzLm1pY3Jvc29mdC5jb20vU3RhcnQvMjAxNC9MYXlvdXRNb2RpZmljYXRpb24iIHhtbG5zOnRhc2tiYXI9Imh0dHA6Ly9zY2hlbWFzLm1pY3Jvc29mdC5jb20vU3RhcnQvMjAxNC9UYXNrYmFyTGF5b3V0Ij4NCiAgPExheW91dE9wdGlvbnMgU3RhcnRUaWxlR3JvdXBDZWxsV2lkdGg9IjYiIC8+DQoJPERlZmF1bHRMYXlvdXRPdmVycmlkZSBMYXlvdXRDdXN0b21pemF0aW9uUmVzdHJpY3Rpb25UeXBlPSJPbmx5U3BlY2lmaWVkR3JvdXBzIj4NCiAgICA8U3RhcnRMYXlvdXRDb2xsZWN0aW9uPg0KICAgICAgPGRlZmF1bHRsYXlvdXQ6U3RhcnRMYXlvdXQgR3JvdXBDZWxsV2lkdGg9IjYiPg0KICAgICAgICA8c3RhcnQ6R3JvdXAgTmFtZT0iQ29yZSBBcHBsaWNhdGlvbnMiPg0KICAgICAgICAgIDxzdGFydDpEZXNrdG9wQXBwbGljYXRpb25UaWxlIFNpemU9IjJ4MiIgQ29sdW1uPSIwIiBSb3c9IjAiIERlc2t0b3BBcHBsaWNhdGlvbklEPSJ7MUFDMTRFNzctMDJFNy00RTVELUI3NDQtMkVCMUFFNTE5OEI3fVxXaW5kb3dzUG93ZXJTaGVsbFx2MS4wXHBvd2Vyc2hlbGwuZXhlIiAvPg0KICAgICAgICAgIDxzdGFydDpUaWxlIFNpemU9IjJ4MiIgQ29sdW1uPSIyIiBSb3c9IjIiIEFwcFVzZXJNb2RlbElEPSJNaWNyb3NvZnQuQ29tcGFueVBvcnRhbF84d2VreWIzZDhiYndlIUFwcCIgLz4NCiAgICAgICAgICA8c3RhcnQ6RGVza3RvcEFwcGxpY2F0aW9uVGlsZSBTaXplPSIyeDIiIENvbHVtbj0iMiIgUm93PSIwIiBEZXNrdG9wQXBwbGljYXRpb25JRD0iezFBQzE0RTc3LTAyRTctNEU1RC1CNzQ0LTJFQjFBRTUxOThCN31cV2luZG93c1Bvd2VyU2hlbGxcdjEuMFxQb3dlclNoZWxsX0lTRS5leGUiIC8+DQogICAgICAgICAgPHN0YXJ0OkRlc2t0b3BBcHBsaWNhdGlvblRpbGUgU2l6ZT0iMngyIiBDb2x1bW49IjAiIFJvdz0iMiIgRGVza3RvcEFwcGxpY2F0aW9uSUQ9Ik1TRWRnZSIgLz4NCiAgICAgICAgPC9zdGFydDpHcm91cD4NCiAgICAgIDwvZGVmYXVsdGxheW91dDpTdGFydExheW91dD4NCiAgICA8L1N0YXJ0TGF5b3V0Q29sbGVjdGlvbj4NCiAgPC9EZWZhdWx0TGF5b3V0T3ZlcnJpZGU+DQoJPEN1c3RvbVRhc2tiYXJMYXlvdXRDb2xsZWN0aW9uIFBpbkxpc3RQbGFjZW1lbnQ9IlJlcGxhY2UiPg0KCQk8ZGVmYXVsdGxheW91dDpUYXNrYmFyTGF5b3V0Pg0KCQkJPHRhc2tiYXI6VGFza2JhclBpbkxpc3Q+DQoJCQkJPHRhc2tiYXI6VVdBIEFwcFVzZXJNb2RlbElEPSJNU0VkZ2UiIC8+DQoJCQkJPHRhc2tiYXI6RGVza3RvcEFwcCBEZXNrdG9wQXBwbGljYXRpb25MaW5rUGF0aD0iJUFQUERBVEElXE1pY3Jvc29mdFxXaW5kb3dzXFN0YXJ0IE1lbnVcUHJvZ3JhbXNcU3lzdGVtIFRvb2xzXEZpbGUgRXhwbG9yZXIubG5rIiAvPg0KCQkJPC90YXNrYmFyOlRhc2tiYXJQaW5MaXN0Pg0KCQk8L2RlZmF1bHRsYXlvdXQ6VGFza2JhckxheW91dD4NCgk8L0N1c3RvbVRhc2tiYXJMYXlvdXRDb2xsZWN0aW9uPg0KPC9MYXlvdXRNb2RpZmljYXRpb25UZW1wbGF0ZT4=",
    "startMenuMode": "userDefined",
    "startMenuPinnedFolderDocuments": "hide",
    "startMenuPinnedFolderDownloads": "notConfigured",
    "startMenuPinnedFolderFileExplorer": "notConfigured",
    "startMenuPinnedFolderHomeGroup": "hide",
    "startMenuPinnedFolderMusic": "hide",
    "startMenuPinnedFolderNetwork": "hide",
    "startMenuPinnedFolderPersonalFolder": "hide",
    "startMenuPinnedFolderPictures": "hide",
    "startMenuPinnedFolderSettings": "notConfigured",
    "startMenuPinnedFolderVideos": "hide",
    "settingsBlockSettingsApp": false,
    "settingsBlockSystemPage": false,
    "settingsBlockDevicesPage": false,
    "settingsBlockNetworkInternetPage": false,
    "settingsBlockPersonalizationPage": false,
    "settingsBlockAccountsPage": false,
    "settingsBlockTimeLanguagePage": false,
    "settingsBlockEaseOfAccessPage": false,
    "settingsBlockPrivacyPage": true,
    "settingsBlockUpdateSecurityPage": false,
    "settingsBlockAppsPage": false,
    "settingsBlockGamingPage": true,
    "windowsSpotlightBlockConsumerSpecificFeatures": false,
    "windowsSpotlightBlocked": false,
    "windowsSpotlightBlockOnActionCenter": false,
    "windowsSpotlightBlockTailoredExperiences": false,
    "windowsSpotlightBlockThirdPartyNotifications": false,
    "windowsSpotlightBlockWelcomeExperience": false,
    "windowsSpotlightBlockWindowsTips": false,
    "windowsSpotlightConfigureOnLockScreen": "notConfigured",
    "networkProxyApplySettingsDeviceWide": false,
    "networkProxyDisableAutoDetect": false,
    "networkProxyAutomaticConfigurationUrl": null,
    "networkProxyServer": null,
    "accountsBlockAddingNonMicrosoftAccountEmail": true,
    "antiTheftModeBlocked": false,
    "bluetoothBlocked": true,
    "cameraBlocked": false,
    "connectedDevicesServiceBlocked": true,
    "certificatesBlockManualRootCertificateInstallation": false,
    "copyPasteBlocked": false,
    "cortanaBlocked": true,
    "deviceManagementBlockFactoryResetOnMobile": false,
    "deviceManagementBlockManualUnenroll": true,
    "safeSearchFilter": "userDefined",
    "edgeBlockPopups": false,
    "edgeBlockSearchSuggestions": false,
    "edgeBlockSearchEngineCustomization": false,
    "edgeBlockSendingIntranetTrafficToInternetExplorer": false,
    "edgeSendIntranetTrafficToInternetExplorer": false,
    "edgeRequireSmartScreen": true,
    "edgeEnterpriseModeSiteListLocation": null,
    "edgeFirstRunUrl": null,
    "edgeHomepageUrls": [],
    "edgeBlockAccessToAboutFlags": false,
    "smartScreenBlockPromptOverride": true,
    "smartScreenBlockPromptOverrideForFiles": true,
    "webRtcBlockLocalhostIpAddress": true,
    "internetSharingBlocked": true,
    "settingsBlockAddProvisioningPackage": true,
    "settingsBlockRemoveProvisioningPackage": true,
    "settingsBlockChangeSystemTime": false,
    "settingsBlockEditDeviceName": false,
    "settingsBlockChangeRegion": false,
    "settingsBlockChangeLanguage": false,
    "settingsBlockChangePowerSleep": false,
    "locationServicesBlocked": true,
    "microsoftAccountBlocked": true,
    "microsoftAccountBlockSettingsSync": true,
    "nfcBlocked": true,
    "resetProtectionModeBlocked": false,
    "screenCaptureBlocked": false,
    "storageBlockRemovableStorage": false,
    "storageRequireMobileDeviceEncryption": false,
    "usbBlocked": false,
    "voiceRecordingBlocked": false,
    "wiFiBlockAutomaticConnectHotspots": false,
    "wiFiBlocked": false,
    "wiFiBlockManualConfiguration": false,
    "wiFiScanInterval": null,
    "wirelessDisplayBlockProjectionToThisDevice": false,
    "wirelessDisplayBlockUserInputFromReceiver": false,
    "wirelessDisplayRequirePinForPairing": true,
    "windowsStoreBlocked": false,
    "appsAllowTrustedAppsSideloading": "allowed",
    "windowsStoreBlockAutoUpdate": false,
    "developerUnlockSetting": "blocked",
    "sharedUserAppDataAllowed": true,
    "appsBlockWindowsStoreOriginatedApps": false,
    "windowsStoreEnablePrivateStoreOnly": true,
    "storageRestrictAppDataToSystemVolume": false,
    "storageRestrictAppInstallToSystemVolume": false,
    "gameDvrBlocked": true,
    "experienceBlockDeviceDiscovery": true,
    "experienceBlockErrorDialogWhenNoSIM": false,
    "experienceBlockTaskSwitcher": false,
    "logonBlockFastUserSwitching": true,
    "tenantLockdownRequireNetworkDuringOutOfBoxExperience": true,
    "appManagementMSIAllowUserControlOverInstall": false,
    "appManagementMSIAlwaysInstallWithElevatedPrivileges": false,
    "dataProtectionBlockDirectMemoryAccess": true,
    "appManagementPackageFamilyNamesToLaunchAfterLogOn": [],
    "uninstallBuiltInApps": false,
    "configureTimeZone": null,
    "defenderDetectedMalwareActions": {
        "lowSeverity": "quarantine",
        "moderateSeverity": "quarantine",
        "highSeverity": "quarantine",
        "severeSeverity": "quarantine"
    },
    "edgeSearchEngine": {
        "@odata.type": "#microsoft.graph.edgeSearchEngine",
        "edgeSearchEngineType": "default"
    },
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(\u0027f164e4d2-cd49-47da-bf8c-4cbfbf0773d8\u0027)/microsoft.graph.windows10CustomConfiguration/microsoft.graph.windows10CustomConfiguration/microsoft.graph.windows10EndpointProtectionConfiguration/microsoft.graph.windows10CustomConfiguration/microsoft.graph.windows10GeneralConfiguration/microsoft.graph.windows10GeneralConfiguration/microsoft.graph.windows10CustomConfiguration/microsoft.graph.windowsIdentityProtectionConfiguration/microsoft.graph.windows10CustomConfiguration/microsoft.graph.windows10GeneralConfiguration/microsoft.graph.windows10EndpointProtectionConfiguration/microsoft.graph.windows10EndpointProtectionConfiguration/microsoft.graph.windows10CustomConfiguration/microsoft.graph.windows10CustomConfiguration/microsoft.graph.windows10GeneralConfiguration/microsoft.graph.windows10EndpointProtectionConfiguration/microsoft.graph.windowsIdentityProtectionConfiguration/microsoft.graph.windows10CustomConfiguration/microsoft.graph.windows10CustomConfiguration/microsoft.graph.windows10GeneralConfiguration/assignments",
    "assignments": [
        {
            "id": "f164e4d2-cd49-47da-bf8c-4cbfbf0773d8_bd1f65b9-891f-40ed-89c2-22433a98ea02",
            "source": "direct",
            "sourceId": "f164e4d2-cd49-47da-bf8c-4cbfbf0773d8",
            "target": {
                "@odata.type": "#microsoft.graph.groupAssignmentTarget",
                "deviceAndAppManagementAssignmentFilterId": null,
                "deviceAndAppManagementAssignmentFilterType": "none",
                "groupId": "Secure-Access-Workstations"
            }
        }
    ]
}