{
    "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
    "roleScopeTagIds": [],
    "id": "070e9f28-9bf1-41cc-b5bb-77229343d3b9",
    "createdDateTime": "2020-11-30T15:27:52.1330905Z",
    "description": "Intune compliance settings to apply after 24 hours\n",
    "lastModifiedDateTime": "2020-11-30T15:27:52.1330905Z",
    "displayName": "SAW-Compliance-Delayed",
    "version": 1,
    "passwordRequired": false,
    "passwordBlockSimple": false,
    "passwordRequiredToUnlockFromIdle": false,
    "passwordMinutesOfInactivityBeforeLock": null,
    "passwordExpirationDays": null,
    "passwordMinimumLength": null,
    "passwordMinimumCharacterSetCount": null,
    "passwordRequiredType": "deviceDefault",
    "passwordPreviousPasswordBlockCount": null,
    "requireHealthyDeviceReport": false,
    "osMinimumVersion": "10.0.18363.476",
    "osMaximumVersion": null,
    "mobileOsMinimumVersion": null,
    "mobileOsMaximumVersion": null,
    "earlyLaunchAntiMalwareDriverEnabled": false,
    "bitLockerEnabled": true,
    "secureBootEnabled": true,
    "codeIntegrityEnabled": true,
    "storageRequireEncryption": false,
    "activeFirewallRequired": true,
    "defenderEnabled": true,
    "defenderVersion": null,
    "signatureOutOfDate": true,
    "rtpEnabled": true,
    "antivirusRequired": true,
    "antiSpywareRequired": true,
    "deviceThreatProtectionEnabled": false,
    "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
    "configurationManagerComplianceRequired": false,
    "tpmRequired": true,
    "deviceCompliancePolicyScript": null,
    "validOperatingSystemBuildRanges": [],
    "assignments": [
        {
            "id": "00000000-0000-0000-0000-000000000000_00000000-0000-0000-0000-000000000000",
            "source": "direct",
            "sourceId": "00000000-0000-0000-0000-000000000000",
            "target": {
                "@odata.type": "#microsoft.graph.groupAssignmentTarget",
                "deviceAndAppManagementAssignmentFilterId": null,
                "deviceAndAppManagementAssignmentFilterType": "none",
                "groupId": "SAW-Devices-UserDriven"
            }
        }
    ],
    "scheduledActionsForRule": [
        {
            "id": "070e9f28-9bf1-41cc-b5bb-77229343d3b9",
            "ruleName": null,
            "scheduledActionConfigurations@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies(\u0027070e9f28-9bf1-41cc-b5bb-77229343d3b9\u0027)/microsoft.graph.windows10CompliancePolicy/microsoft.graph.windows10CompliancePolicy/scheduledActionsForRule(\u0027070e9f28-9bf1-41cc-b5bb-77229343d3b9\u0027)/scheduledActionConfigurations",
            "scheduledActionConfigurations": [
                {
                    "id": "cab389d9-845f-4d0a-a9cd-e64abbcbd859",
                    "gracePeriodHours": 24,
                    "actionType": "block",
                    "notificationTemplateId": "00000000-0000-0000-0000-000000000000",
                    "notificationMessageCCList": []
                }
            ]
        }
    ]
}