{
    "settings": {
        "displayName": "Secure Workstation User Driven",
        "description": "Profile for SAW User driven",
        "mode": "UserDrivenAAD",
        "ConvertDeviceToAutopilot": true,
        "OOBE_language": "os_default",
        "OOBE_skipKeyboard": true,
        "OOBE_NameTemplate": "SAW-%SERIAL%",
        "OOBE_EnableWhiteGlove": false,
        "OOBE_UserTypeAdmin": false,
        "OOBE_HideEULA": true,
        "OOBE_hidePrivacySettings": true,
        "OOBE_HideChangeAccountOpts": true,
        "OOBE_SkipConnectivityCheck": true
    },
    "roleScopeTagIds": [
        "Privileged-Identity"
    ],
    "assignments": [
        "SAW-Devices-UserDriven"
    ]
}