{
    "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
    "roleScopeTagIds": [
        "Privileged-Identity"
    ],
    "id": "56454fb5-78ae-4489-a4de-c60aeeb4bb8b",
    "createdDateTime": "2020-11-30T15:27:53.2888215Z",
    "description": "Intune compliance settings to apply immediately\n",
    "lastModifiedDateTime": "2020-11-30T15:27:53.2888215Z",
    "displayName": "PAW-Compliance-Immediate",
    "version": 1,
    "passwordRequired": false,
    "passwordBlockSimple": false,
    "passwordRequiredToUnlockFromIdle": false,
    "passwordMinutesOfInactivityBeforeLock": null,
    "passwordExpirationDays": null,
    "passwordMinimumLength": null,
    "passwordMinimumCharacterSetCount": null,
    "passwordRequiredType": "deviceDefault",
    "passwordPreviousPasswordBlockCount": null,
    "requireHealthyDeviceReport": false,
    "osMinimumVersion": "10.0.18363.476",
    "osMaximumVersion": null,
    "mobileOsMinimumVersion": null,
    "mobileOsMaximumVersion": null,
    "earlyLaunchAntiMalwareDriverEnabled": false,
    "bitLockerEnabled": false,
    "secureBootEnabled": false,
    "codeIntegrityEnabled": false,
    "storageRequireEncryption": false,
    "activeFirewallRequired": false,
    "defenderEnabled": true,
    "defenderVersion": null,
    "signatureOutOfDate": false,
    "rtpEnabled": true,
    "antivirusRequired": true,
    "antiSpywareRequired": false,
    "deviceThreatProtectionEnabled": false,
    "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
    "configurationManagerComplianceRequired": false,
    "tpmRequired": false,
    "deviceCompliancePolicyScript": null,
    "validOperatingSystemBuildRanges": [],
    "assignments": [
        {
            "id": "56454fb5-78ae-4489-a4de-c60aeeb4bb8b_add56c8b-3fb1-43c8-a7d8-3abcc9f9ac64",
            "source": "direct",
            "sourceId": "56454fb5-78ae-4489-a4de-c60aeeb4bb8b",
            "target": {
                "@odata.type": "#microsoft.graph.exclusionGroupAssignmentTarget",
                "deviceAndAppManagementAssignmentFilterId": null,
                "deviceAndAppManagementAssignmentFilterType": "none",
                "groupId": "Emergency Breakglass"
            }
        },
        {
            "id": "56454fb5-78ae-4489-a4de-c60aeeb4bb8b_af977e97-e18b-4272-bb63-81fb28204780",
            "source": "direct",
            "sourceId": "56454fb5-78ae-4489-a4de-c60aeeb4bb8b",
            "target": {
                "@odata.type": "#microsoft.graph.groupAssignmentTarget",
                "deviceAndAppManagementAssignmentFilterId": null,
                "deviceAndAppManagementAssignmentFilterType": "none",
                "groupId": "Privileged Workstation Users"
            }
        }
    ],
    "scheduledActionsForRule": [
        {
            "id": "56454fb5-78ae-4489-a4de-c60aeeb4bb8b",
            "ruleName": null,
            "scheduledActionConfigurations@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies(\u002756454fb5-78ae-4489-a4de-c60aeeb4bb8b\u0027)/microsoft.graph.windows10CompliancePolicy/microsoft.graph.windows10CompliancePolicy/microsoft.graph.windows10CompliancePolicy/microsoft.graph.windows10CompliancePolicy/scheduledActionsForRule(\u002756454fb5-78ae-4489-a4de-c60aeeb4bb8b\u0027)/scheduledActionConfigurations",
            "scheduledActionConfigurations": [
                {
                    "id": "59ae4e45-6495-4d33-b943-1bb01554bc6f",
                    "gracePeriodHours": 0,
                    "actionType": "block",
                    "notificationTemplateId": "00000000-0000-0000-0000-000000000000",
                    "notificationMessageCCList": []
                }
            ]
        }
    ]
}