{
    "@odata.type": "#microsoft.graph.windowsIdentityProtectionConfiguration",
    "id": "9218cdda-e28d-451e-96c6-1e6b9a9f292d",
    "lastModifiedDateTime": "2020-11-16T18:06:54.6907925Z",
    "roleScopeTagIds": [
        "Privileged-Identity"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2020-11-16T17:58:38.498837Z",
    "description": "",
    "displayName": "PAW-Win10-Config-Identity-Protection-UI",
    "version": 2,
    "useSecurityKeyForSignin": true,
    "enhancedAntiSpoofingForFacialFeaturesEnabled": true,
    "pinMinimumLength": 6,
    "pinMaximumLength": 100,
    "pinUppercaseCharactersUsage": "blocked",
    "pinLowercaseCharactersUsage": "blocked",
    "pinSpecialCharactersUsage": "blocked",
    "pinExpirationInDays": null,
    "pinPreviousBlockCount": null,
    "pinRecoveryEnabled": true,
    "securityDeviceRequired": true,
    "unlockWithBiometricsEnabled": true,
    "useCertificatesForOnPremisesAuthEnabled": false,
    "windowsHelloForBusinessBlocked": false,
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(\u00279218cdda-e28d-451e-96c6-1e6b9a9f292d\u0027)/microsoft.graph.windows10CustomConfiguration/microsoft.graph.windows10CustomConfiguration/microsoft.graph.windows10EndpointProtectionConfiguration/microsoft.graph.windows10CustomConfiguration/microsoft.graph.windows10GeneralConfiguration/microsoft.graph.windows10GeneralConfiguration/microsoft.graph.windows10CustomConfiguration/microsoft.graph.windowsIdentityProtectionConfiguration/microsoft.graph.windows10CustomConfiguration/microsoft.graph.windows10GeneralConfiguration/microsoft.graph.windows10EndpointProtectionConfiguration/microsoft.graph.windows10EndpointProtectionConfiguration/microsoft.graph.windows10CustomConfiguration/microsoft.graph.windows10CustomConfiguration/microsoft.graph.windows10GeneralConfiguration/microsoft.graph.windows10EndpointProtectionConfiguration/microsoft.graph.windowsIdentityProtectionConfiguration/microsoft.graph.windows10CustomConfiguration/microsoft.graph.windows10CustomConfiguration/microsoft.graph.windows10GeneralConfiguration/microsoft.graph.windows10EndpointProtectionConfiguration/microsoft.graph.windowsIdentityProtectionConfiguration/assignments",
    "assignments": [
        {
            "id": "00000000-0000-0000-0000-000000000000_00000000-0000-0000-0000-000000000000",
            "source": "direct",
            "sourceId": "00000000-0000-0000-0000-000000000000",
            "target": {
                "@odata.type": "#microsoft.graph.groupAssignmentTarget",
                "deviceAndAppManagementAssignmentFilterId": null,
                "deviceAndAppManagementAssignmentFilterType": "none",
                "groupId": "SAW-Devices-UserDriven"
            }
        },
        {
            "id": "00000000-0000-0000-0000-000000000000_00000000-0000-0000-0000-000000000000",
            "source": "direct",
            "sourceId": "00000000-0000-0000-0000-000000000000",
            "target": {
                "@odata.type": "#microsoft.graph.groupAssignmentTarget",
                "deviceAndAppManagementAssignmentFilterId": null,
                "deviceAndAppManagementAssignmentFilterType": "none",
                "groupId": "SAW-Devices-SelfDeploying"
            }
        }
    ]
}